; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 768791 2 2 2 7 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	spectrograph0 - mode
	image1 - mode
	Star0 - direction
	GroundStation2 - direction
	Star6 - direction
	Star3 - direction
	Star4 - direction
	Star1 - direction
	Star5 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 Star5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument1 image1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star4)
	(supports instrument2 image1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star5)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet9)
)
(:goal (and
	(pointing satellite0 Star0)
	(have_image Star7 image1)
	(have_image Planet8 spectrograph0)
	(have_image Planet9 spectrograph0)
))

)

; plan
1. (turn_to satellite0 star0 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star0)
   goals met: 1 of 4
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 4
3. (turn_to satellite1 star1 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star1)
   goals met: 1 of 4
4. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 4
5. (calibrate satellite1 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 1 of 4
6. (turn_to satellite0 planet9 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet9)
   goals met: 0 of 4
7. (turn_to satellite1 star7 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star7)
   goals met: 0 of 4
8. (turn_to satellite0 star0 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star0)
   goals met: 1 of 4
9. (take_image satellite1 star7 instrument1 image1)
   added: (have_image star7 image1)
   goals met: 2 of 4
10. (turn_to satellite0 planet9 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet9)
   goals met: 1 of 4
11. (turn_to satellite1 planet8 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet8)
   goals met: 1 of 4
12. (turn_to satellite0 star0 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star0)
   goals met: 2 of 4
13. (take_image satellite1 planet8 instrument1 spectrograph0)
   added: (have_image planet8 spectrograph0)
   goals met: 3 of 4
14. (turn_to satellite1 planet9 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet9)
   goals met: 3 of 4
15. (take_image satellite1 planet9 instrument1 spectrograph0)
   added: (have_image planet9 spectrograph0)
   goals met: 4 of 4
